In [1]:
import pandas as pd

In [12]:
df1 = pd.DataFrame({
    "city": ["new york", "chicago", "orlando", "baltimore"],
    "tempertaure": [21,14,35, 32],
})

In [13]:
df1

        city  tempertaure
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           32

In [20]:
df2 = pd.DataFrame({
    "city":["chicago", "new york", "san francisco"],
    "humidity": [65,68,71], 
})

In [21]:
df2

            city  humidity
0        chicago        65
1       new york        68
2  san francisco        71

In [24]:
df3 = pd.merge(df1, df2, on = "city", how = "outer", indicator=True)

In [25]:
df3

            city  tempertaure  humidity      _merge
0       new york         21.0      68.0        both
1        chicago         14.0      65.0        both
2        orlando         35.0       NaN   left_only
3      baltimore         32.0       NaN   left_only
4  san francisco          NaN      71.0  right_only

In [26]:
df1 = pd.DataFrame({
    "city": ["new york", "chicago", "orlando", "baltimore"],
    "tempertaure": [21,14,35,32],
    "humidity":[65,68,71,75]
})

In [27]:
df1

        city  tempertaure  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           32        75

In [29]:
df2 = pd.DataFrame({
    "city": ["chicago", "new york", "san diego"],
    "tempertaure": [21,14,35],
    "humidity":[65,68,71]
})

In [30]:
df2

        city  tempertaure  humidity
0    chicago           21        65
1   new york           14        68
2  san diego           35        71

In [34]:
df3 = pd.merge(df1, df2, on="city", suffixes=('_left', '_right'))

In [35]:
df3

,city,tempertaure_left,humidity_left,tempertaure_right,humidity_right
0,chicago,21,65,21,65
1,new york,14,68,14,68
2,san diego,35,71,35,71